"""
Загрузите	изображение	с	достаточно	"богатой"	сценой.	Примените	к	изображению
функцию	cvThreshold()	с	порогом	128.	Воспользуйтесь	всеми	параметрами	из
таблицы	5-5	и	отобразите	результаты.	Осознание	принципов	работы	порогового
преобразования	принесет	еще	не	мало	пользы	в	дальнейшем.
a.	Повторите	упражнение,	но	уже	с	использованием	функции
cvAdaptiveThreshold().	Установите	param1	=	5.
b.	Повторите	предыдущий	пункт,	используя	сначала	параметр	param1	=	0,	а	затем
к	результату	вновь	примените	функцию	cvAdaptiveThreshold(),	но	уже	с
параметром	param1	=	-5.


"""




